{"title":"Architect Personality","description":"An Architect (INTJ) is a person with the Introverted, Intuitive, Thinking, and Judging personality traits. These thoughtful tacticians love perfecting the details of life, applying creativity and rationality to everything they do. Their inner world is often a private, complex one.","heroBanner":{},"introText":"An Architect (INTJ) is a person with the Introverted, Intuitive, Thinking, and Judging personality traits. These thoughtful tacticians love perfecting the details of life, applying creativity and rationality to everything they do. Their inner world is often a private, complex one.","artBody":[{},{},{},{"text":"It can be lonely at the top. Being one of the rarest personality types and being among the most capable people, Architects know this all too well. They make up just two percent of the population, and women with this personality type are especially rare, forming only 0.8%. It can be difficult for Architects to find people who can keep up with their non-stop analysis of things. People with this personality type are imaginative yet decisive... ambitious yet like their privacy... curious about everything but remain focused."},{},{"heading":"The Right Attitude for Meeting Goals"},{"text":"With a natural thirst for knowledge that shows itself early in life, other kids at school often call Architects “bookworms.” While their peers may intend to insult them, those with this personality type likely identify with the label. Throughout their lives, they’re proud of how much they know, and Architects enjoy sharing the knowledge they gain. They’re confident in their mastery of their chosen subjects. They are serious and prefer to design and carry out effective plans rather than waste their time with foolish distractions like gossip."},{},{"text":"Architects accept and work with inconsistencies that make perfect sense to them – at least from a purely rational standpoint. For example, Architects can be both the most positive dreamers and the bitterest pessimists at the same time. On the positive side, these personalities believe nothing is impossible with enough effort, intellect, and thought. On the negative side, they might also believe that people are usually too lazy, unimaginative, or selfish to reach hard goals. But this idea won’t put them off chasing their own."},{"heading":"Standing on Logic and Principles"},{"text":"Architects are self-confident in the skills and ideas they focus on. Using their insights and logic, they push innovation through by sheer willpower. It may seem that Architects constantly deconstruct and rebuild every idea and system they encounter. They typically apply a sense of perfectionism and even morality to all their work. Anyone who can’t keep up with Architects’ processes or doesn’t see the point of them is likely to lose their respect."},{},{"text":"Architect personality types dislike rules, restrictions, and traditions. For them, everything should be subject to questions and reviews. When they can, Architects often act alone, and their approaches are usually innovative and unique. They may not wait for others to catch up to them. Because of this, they’re sometimes not as sensitive as they could be to the thoughts, desires, and plans of others."},{"text":"But they aren’t impulsive. Architects strive to remain rational no matter how attractive an easy but ill-considered route might be. Every idea must pass the strict and ever-present “Does this make sense?” and “Is this going to work?” filters. They apply the filters to all things and all people, and this is sometimes where Architect personalities run into trouble."},{"heading":"Traveling Alone and Accomplishing Much"},{"text":"Architects are confident in the subjects they take the time to understand, but, unfortunately, they are reluctant to bother with topics that involve social skills. White lies and small talk, even when useful, are hard for a personality type that needs truth and depth. Architects may even see many social practices as downright stupid."},{"text":"Ironically, it is often best for Architects to remain where they’re comfortable – out of the spotlight. They have natural confidence there. If they stay within their element and do what they do best, they are likely to draw people to them, professionally, socially, and even romantically. They are fine on their own, and reaching out is often optional."},{"text":"This strategic style isn’t meant to suggest that Architects act coldly and without conscience. But Architects like to win and dislike acting solely on emotions, and this can make it seem that way to other types who don’t understand them well. This may explain why many fictional villains are modeled on this personality type. But Architects are as likely as anyone else to act from integrity – or more, if to do so makes clear sense."},{"text":"Architects move through life as though it were a giant chessboard, advancing and retreating with considered intelligence. This personality type always looks for new tactics, strategies, and contingency plans. They constantly outsmart their peers as they maintain control, all the while making the most of their independent style of thinking. With this, they can achieve any goal they apply themselves to."},{}]}